# -*- coding: utf-8 -*-
## ================================================================
## オリジナル配列
## ================================================================

require_relative '../romaji_table'

## ================================================================
## 鍵盤の設定
## ================================================================
子音鍵 = {
  あ行: nil,
  か行: {左右: :左, 段: :中, 番号: 3},
  が行: {左右: :左, 段: :下, 番号: 3},
  さ行: {左右: :左, 段: :中, 番号: 2},
  ざ行: {左右: :左, 段: :下, 番号: 2},
  た行: {左右: :左, 段: :中, 番号: 1},
  だ行: {左右: :左, 段: :下, 番号: 1},
  な行: {左右: :左, 段: :中, 番号: 0},
  は行: {左右: :左, 段: :中, 番号: 4},
  ば行: {左右: :左, 段: :下, 番号: 4},
  ぱ行: {左右: :左, 段: :上, 番号: 4},
  ま行: {左右: :左, 段: :上, 番号: 3},
  や行: {左右: :左, 段: :上, 番号: 2},
  ら行: {左右: :左, 段: :上, 番号: 1},
  わ行: {左右: :左, 段: :上, 番号: 0},
  ゔ行: {左右: :左, 段: :下, 番号: 0},
}

小文字鍵 = {左右: :左, 段: :下, 番号: 0}

あ = [{左右: :右, 段: :中, 番号: 0}]
# い = [{左右: :右, 段: :中, 番号: 1}]
う = [{左右: :右, 段: :中, 番号: 2}]
え = [{左右: :右, 段: :中, 番号: 3}]
お = [{左右: :右, 段: :中, 番号: 4}]

左人指右 = {左右: :左, 番号: 4}
左人指   = {左右: :左, 番号: 3}
左中指   = {左右: :左, 番号: 2}
左薬指   = {左右: :左, 番号: 1}
左小指 = {左右: :左, 番号: 0}

右上段 = {左右: :右, 段: :上}
右中段 = {左右: :右, 段: :中}
右下段 = {左右: :右, 段: :下}
右上段シフト = {左右: :右, 段: :上, シフト: true}
右中段シフト = {左右: :右, 段: :中, シフト: true}
右下段シフト = {左右: :右, 段: :下, シフト: true}

母音順登録([0, 1, 2, 3, 4])

## ================================================================
## 直音の変換
## ================================================================
五十音合成(直音行).each do |かな, 行|
  変換 かな, 開始鍵: 子音鍵[行], 確定鍵: 右中段
  変換 かな, 追加文字: 'ん', 開始鍵: 子音鍵[行], 確定鍵: 右下段
  変換 かな, 追加文字: 'っ', 開始鍵: 子音鍵[行], 確定鍵: 右上段
end

## ================================================================
## ア母音 | (haa)    | ハイ hai | ハウ hau | ハエ hae | ハオ hao |   4 |
## ================================================================
五十音合成(直音行 - [:あ行], 列: :あ列, 行: :ぁ行).each do |かな, 行|
  変換(かな, 開始鍵: 子音鍵[行], 中間鍵: 左人指右, 確定鍵: 右中段)
  変換(かな, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 左人指右, 確定鍵: 右下段)
  変換(かな, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 左人指右, 確定鍵: 右上段)
end

## ================================================================
## | イ母音 | ヒャ hya | (hyi)    | ヒュ hyu | ヒェ hye | ヒョ hyo |   3 |
## ================================================================
五十音合成(直音行 - [:あ行, :や行, :わ行] + [:ゔ行], 列: :い列, 行: :ゃ行).each do |かな, 行|
  変換(かな, 開始鍵: 子音鍵[行], 中間鍵: 左人指, 確定鍵: 右中段)
  変換(かな, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 左人指, 確定鍵: 右下段)
  変換(かな, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 左人指, 確定鍵: 右上段)
end

## ================================================================
## | ウ母音 | ファ hwa | フィ hwi | (hwu)    | フェ hwe | フォ hwo |   2 |
## ================================================================
五十音合成(直音行 - [:あ行, :や行, :わ行] + [:ゔ行], 列: :う列, 行: :ぁ行).each do |かな, 行|
  変換(かな, 開始鍵: 子音鍵[行], 中間鍵: 左中指, 確定鍵: 右中段)
  変換(かな, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 左中指, 確定鍵: 右下段)
  変換(かな, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 左中指, 確定鍵: 右上段)
end

## ================================================================
## | エ母音 | ヘア hea | ヘイ hei | ヘウ heu | (hee)    | ヘオ heo |   1 |
## ================================================================
五十音合成(直音行 - [:あ行], 列: :え列, 行: :ぁ行).each do |かな, 行|
  変換(かな, 開始鍵: 子音鍵[行], 中間鍵: 左薬指, 確定鍵: 右中段)
  変換(かな, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 左薬指, 確定鍵: 右下段)
  変換(かな, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 左薬指, 確定鍵: 右上段)
end

## ================================================================
## | オ母音 | ホア hoa | ホイ hoi | ホウ hou | ホエ hoe | (hoo)    |   0 |
## ================================================================
五十音合成(直音行 - [:あ行], 列: :お列, 行: :ぁ行).each do |かな, 行|
  変換(かな, 開始鍵: 子音鍵[行], 中間鍵: 左小指, 確定鍵: 右中段)
  変換(かな, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 左小指, 確定鍵: 右下段)
  変換(かな, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 左小指, 確定鍵: 右上段)
end

## ================================================================
## ア母音 | (haa)    | ハイ hai | ハウ hau | ハエ hae | ハオ hao |   4 |
## ================================================================
五十音合成(直音行, 列: :あ列, 行: :あ行).each do |かな, 行|
  変換(かな, 開始鍵: 子音鍵[行], 確定鍵: 右上段シフト)
end

## ================================================================
## | エ母音 | ヘア hea | ヘイ hei | ヘウ heu | (hee)    | ヘオ heo |   1 |
## ================================================================
五十音合成(直音行, 列: :え列, 行: :あ行).each do |かな, 行|
  変換(かな, 開始鍵: 子音鍵[行], 確定鍵: 右中段シフト)
end

## ================================================================
## | オ母音 | ホア hoa | ホイ hoi | ホウ hou | ホエ hoe | (hoo)    |   0 |
## ================================================================
# KyOU
五十音合成(直音行, 列: :お列, 行: :あ行).each do |かな, 行|
  変換(かな, 開始鍵: 子音鍵[行], 確定鍵: 右下段シフト)
end

変換 :ぁ行,    開始鍵: 小文字鍵, 確定鍵: 右中段
変換 'ゃゅょ', 開始鍵: 小文字鍵, 中間鍵: 子音鍵[:や行], 確定鍵: あ + う + お
変換 'ゎ',     開始鍵: 小文字鍵, 中間鍵: 子音鍵[:わ行], 確定鍵: あ
変換 'ゕ',     開始鍵: 小文字鍵, 中間鍵: 子音鍵[:か行], 確定鍵: あ
変換 'ゖ',     開始鍵: 小文字鍵, 中間鍵: 子音鍵[:か行], 確定鍵: え
変換 'っ',     開始鍵: 小文字鍵, 中間鍵: 子音鍵[:た行], 確定鍵: う
# ゝ ゞ ゟ
変換 'ん', 確定鍵: 子音鍵[:な行]
変換 'ん', 開始鍵: 子音鍵[:な行], 確定鍵: {範囲外: "'"}
変換 '，', 開始鍵: 子音鍵[:や行], 確定鍵: 子音鍵[:ま行]
変換 '．', 開始鍵: 子音鍵[:や行], 確定鍵: 子音鍵[:ら行]
変換 'ー', 確定鍵: {範囲外: "-"}

変換表出力
# TODO: 文字生成の母音を省略したら，「あいうえお」にする
# TODO: HiYaKu, HyaKu
