# -*- coding: utf-8 -*-
## ================================================================
## オリジナル配列
## ================================================================

require_relative '../romaji_table'

子音鍵 = {
  あ行: nil,
  か行: {左右: :左, 段: :中, 番号: 3},
  が行: {左右: :左, 段: :下, 番号: 3},
  さ行: {左右: :左, 段: :中, 番号: 2},
  ざ行: {左右: :左, 段: :下, 番号: 2},
  た行: {左右: :左, 段: :中, 番号: 1},
  だ行: {左右: :左, 段: :下, 番号: 1},
  な行: {左右: :左, 段: :中, 番号: 0},
  は行: {左右: :左, 段: :中, 番号: 4},
  ば行: {左右: :左, 段: :下, 番号: 4},
  ぱ行: {左右: :左, 段: :上, 番号: 4},
  ま行: {左右: :左, 段: :上, 番号: 3},
  や行: {左右: :左, 段: :上, 番号: 2},
  ら行: {左右: :左, 段: :上, 番号: 1},
  わ行: {左右: :左, 段: :上, 番号: 0},
  ゔ行: {左右: :左, 段: :下, 番号: 0},
}

小文字鍵 = {左右: :左, 段: :下, 番号: 0}

あ = [{左右: :右, 段: :中, 番号: 0}]
# い = [{左右: :右, 段: :中, 番号: 1}]
う = [{左右: :右, 段: :中, 番号: 2}]
え = [{左右: :右, 段: :中, 番号: 3}]
お = [{左右: :右, 段: :中, 番号: 4}]

母音順登録([0, 1, 2, 3, 4])

左人指 = {左右: :左, 番号: 3}
左中指 = {左右: :左, 番号: 2}
左薬指 = {左右: :左, 番号: 1}
# 左小指 = {左右: :左, 番号: 0}

右上段 = {左右: :右, 段: :上}
右中段 = {左右: :右, 段: :中}
右下段 = {左右: :右, 段: :下}
# 右上段シフト = {左右: :右, 段: :上, シフト: true}
# 右中段シフト = {左右: :右, 段: :中, シフト: true}
# 右下段シフト = {左右: :右, 段: :下, シフト: true}

あいうえお = ['あ', 'い', 'う', 'え', 'お']

直音行.each do|行|
  変換 行, 開始鍵: 子音鍵[行], 確定鍵: 右中段
  変換 行, 追加文字: 'ん', 開始鍵: 子音鍵[行], 確定鍵: 右下段
  変換 行, 追加文字: 'っ', 開始鍵: 子音鍵[行], 確定鍵: 右上段
end

# ['ああ', 'あい', 'あう', 'あえ', 'あお']

イ列ヤ行拗音行 = 直音行 - [:あ行, :や行, :わ行] + [:ゔ行]
文字生成(イ列ヤ行拗音行, あいうえお, 拗音化: [:い列, :ゃ行]).each do |文字, 行|
  拗音鍵 = 子音鍵[行][:番号] >= 3 ? 左薬指 : 左人指
  変換(文字, 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右中段)
  変換(文字, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右下段)
  変換(文字, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右上段)
end

ウ列ワ行拗音行 = 直音行 - [:あ行, :や行, :わ行] + [:ゔ行]
文字生成(ウ列ワ行拗音行, あいうえお, 拗音化: [:う列, :ぁ行]).each do |文字, 行|
  拗音鍵 = 子音鍵[行][:番号] < 3 ? 左薬指 : 左人指
  変換(文字, 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右中段)
  変換(文字, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右下段)
  変換(文字, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右上段)
end

エ列ヤ行拗音行 = [:た行, :だ行]
文字生成(エ列ヤ行拗音行, あいうえお, 拗音化: [:え列, :ゃ行]).each do |文字, 行|
  拗音鍵 = 左中指
  変換(文字, 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右中段)
  変換(文字, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右下段)
  変換(文字, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右上段)
end

# エ列ワ行拗音行 = [:た行, :だ行] # , :は行
# 文字生成(エ列ワ行拗音行, あいうえお, 拗音化: [:え列, :ぁ行]).each do |文字, 行|
#   拗音鍵 = 左小指
#   変換(文字, 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右中段)
#   変換(文字, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右下段)
#   変換(文字, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右上段)
# end

# ヴの扱いと統合する
ウ列ヤ行拗音行 = [:は行]
文字生成(ウ列ヤ行拗音行, あいうえお, 拗音化: [:う列, :ゃ行]).each do |文字, 行|
  拗音鍵 = 左中指
  変換(文字, 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右中段)
  変換(文字, 追加文字: 'ん', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右下段)
  変換(文字, 追加文字: 'っ', 開始鍵: 子音鍵[行], 中間鍵: 拗音鍵, 確定鍵: 右上段)
end

変換 :ぁ行,    開始鍵: 小文字鍵, 確定鍵: 右中段
変換 'ゃゅょ', 開始鍵: 小文字鍵, 中間鍵: 子音鍵[:や行], 確定鍵: あ + う + お
変換 'ゎ',     開始鍵: 小文字鍵, 中間鍵: 子音鍵[:わ行], 確定鍵: あ
変換 'ゕ',     開始鍵: 小文字鍵, 中間鍵: 子音鍵[:か行], 確定鍵: あ
変換 'ゕ',     開始鍵: 小文字鍵, 中間鍵: 子音鍵[:か行], 確定鍵: え
変換 'っ',     開始鍵: 小文字鍵, 中間鍵: 子音鍵[:た行], 確定鍵: う
# ゝ ゞ ゟ
変換 'ん', 確定鍵: 子音鍵[:な行]
変換 'ん', 開始鍵: 子音鍵[:な行], 確定鍵: {範囲外: "'"}
変換 '，', 開始鍵: 子音鍵[:や行], 確定鍵: 子音鍵[:ま行]
変換 '．', 開始鍵: 子音鍵[:や行], 確定鍵: 子音鍵[:ら行]
変換 'ー', 確定鍵: {範囲外: "-"}

変換表出力

# TODO: 文字生成の母音を省略したら，「あいうえお」にする
