# -*- coding: utf-8 -*-
## ================================================================
## ローマ字のつづり方：文部科学省
## - http://www.mext.go.jp/b_menu/hakusho/nc/k19541209001/k19541209001.html
## ================================================================

require_relative '../romaji_table'

鍵盤登録 RomajiTable::Qwerty

子音鍵 = {
  あ行: nil,
  か行: {左右: :右, 段: :中, 番号: 2}, # k
  さ行: {左右: :左, 段: :中, 番号: 1}, # s
  た行: {左右: :左, 段: :上, 番号: 4}, # t
  な行: {左右: :右, 段: :下, 番号: 0}, # n
  は行: {左右: :右, 段: :中, 番号: 0}, # h
  ま行: {左右: :右, 段: :下, 番号: 1}, # m
  や行: {左右: :右, 段: :上, 番号: 0}, # y
  ら行: {左右: :左, 段: :上, 番号: 3}, # r
  わ行: {左右: :左, 段: :上, 番号: 1}, # w
  が行: {左右: :左, 段: :中, 番号: 4}, # g
  ざ行: {左右: :左, 段: :下, 番号: 0}, # z
  だ行: {左右: :左, 段: :中, 番号: 2}, # d
  ば行: {左右: :左, 段: :下, 番号: 4}, # b
  ぱ行: {左右: :右, 段: :上, 番号: 4}, # p
}

あ = [{左右: :左, 段: :中, 番号: 0}]
い = [{左右: :右, 段: :上, 番号: 2}]
え = [{左右: :左, 段: :上, 番号: 2}]
う = [{左右: :右, 段: :上, 番号: 1}]
お = [{左右: :右, 段: :上, 番号: 3}]

## ================================================================
## 第1表 〔(　)は重出を示す〕
## ================================================================
=begin
 第1表 〔(　)は重出を示す〕
 a      i       u       e       o
ka      ki      ku      ke      ko      kya     kyu     kyo
sa      si      su      se      so      sya     syu     syo
ta      ti      tu      te      to      tya     tyu     tyo
na      ni      nu      ne      no      nya     nyu     nyo
ha      hi      hu      he      ho      hya     hyu     hyo
ma      mi      mu      me      mo      mya     myu     myo
ya      (i)     yu      (e)     yo
ra      ri      ru      re      ro      rya     ryu     ryo
wa      (i)     (u)     (e)     (o)
ga      gi      gu      ge      go      gya     gyu     gyo
za      zi      zu      ze      zo      zya     zyu     zyo
da      (zi)    (zu)    de      do      (zya)   (zyu)   (zyo)
ba      bi      bu      be      bo      bya     byu     byo
pa      pi      pu      pe      po      pya     pyu     pyo
=end

通常行 = 直音行 - [:や行, :わ行, :だ行]
通常行.each do|行|
  変換 行, 開始鍵: 子音鍵[行]
end

変換 'やゆよ', 開始鍵: 子音鍵[:や行], 確定鍵: あ + う + お
変換 'わ',     開始鍵: 子音鍵[:わ行], 確定鍵: あ
変換 'だでど', 開始鍵: 子音鍵[:だ行], 確定鍵: あ + え + お

拗音行 = 直音行 - [:あ行, :や行, :わ行, :だ行]
母音指定(拗音行, ['あ', 'う', 'お'], 拗音化: [:い列, :ゃ行]) do |文字, 行|
  変換 文字, 開始鍵: 子音鍵[行], 中間鍵: 子音鍵[:や行], 確定鍵: あ + う + お
end

## ================================================================
## 第2表
## ================================================================
=begin
第2表
sha     shi     shu     sho
                tsu
cha     chi     chu     cho
                fu
ja      ji      ju      jo
di              du
dya             dyu     dyo
kwa
gwa
                        wo
=end

変換 ['しゃ', 'し', 'しゅ', 'しょ'], 開始鍵: 子音鍵[:さ行], 中間鍵: 子音鍵[:は行], 確定鍵: あ + い + う + お
変換 'つ', 開始鍵: 子音鍵[:た行], 中間鍵: 子音鍵[:さ行], 確定鍵: う
変換 ['ちゃ', 'ち', 'ちゅ', 'ちょ'], 開始鍵: {左右: :左, 段: :下, 番号: 2}, 中間鍵: 子音鍵[:は行], 確定鍵: あ + い + う + お
変換 'ふ', 開始鍵: {左右: :左, 段: :中, 番号: 3}, 確定鍵: う
変換 ['じゃ', 'じ', 'じゅ', 'じょ'], 開始鍵: {左右: :右, 段: :中, 番号: 1}, 確定鍵: あ + い + う + お
変換 'ぢづ', 開始鍵: {左右: :左, 段: :中, 番号: 2}, 確定鍵: い + う
変換 ['ぢゃ', 'ぢゅ', 'ぢょ'], 開始鍵: {左右: :左, 段: :中, 番号: 2}, 中間鍵: 子音鍵[:や行], 確定鍵: あ + う + お
変換 ['くゎ'], 開始鍵: 子音鍵[:か行], 中間鍵: 子音鍵[:わ行], 確定鍵: あ
変換 ['ぐゎ'], 開始鍵: 子音鍵[:が行], 中間鍵: 子音鍵[:わ行], 確定鍵: あ
変換 'を', 開始鍵: 子音鍵[:わ行], 確定鍵: お

################################################################
# そえがき
################################################################
=begin
そえがき

前表に定めたもののほか、おおむね次の各項による。

    はねる音「ン」はすべて n と書く。
    はねる音を表す n と次にくる母音字または y とを切り離す必要がある場合には、n の次に ' を入れる。
    つまる音は、最初の子音字を重ねて表わす。
    長音は母音字の上に ^ をつけて表わす。なお、大文字の場合は母音字を並べてもよい。
    特殊音の書き表し方は自由とする。
    文の書きはじめ、および固有名詞は語頭を大文字で書く。なお、固有名詞以外の名詞の語頭を大文字で書いてもよい。
=end

変換 'ん', 確定鍵: 子音鍵[:な行]
変換 'ん', 開始鍵: 子音鍵[:な行], 確定鍵: {範囲外: "'"}

あ行以外 = 直音行 - [:あ行]
あ行以外.each do |行|
  変換 'っ', 開始鍵: 子音鍵[行], 確定鍵: 子音鍵[行], 次開始鍵: 子音鍵[行]
end

変換表出力
