# -*- coding: utf-8 -*-

=begin
@markup markdown
# hoge
[Class: YARD::CLI::Yardoc — Documentation for yard (0.8.7)](http://rubydoc.info/docs/yard/YARD/CLI/Yardoc)
[99式ローマ字](http://roomazi.org/99/details.html)
=end
class C五十音
  attr :表

  def initialize
    @表 = {
      # 表1a 直音をあらわすカナ
      あ行:     ['あ',   'い',   'う',   'え',   'お'  ],
      か行:     ['か',   'き',   'く',   'け',   'こ'  ],
      さ行:     ['さ',   'し',   'す',   'せ',   'そ'  ],
      た行:     ['た',   'ち',   'つ',   'て',   'と'  ],
      な行:     ['な',   'に',   'ぬ',   'ね',   'の'  ],
      は行:     ['は',   'ひ',   'ふ',   'へ',   'ほ'  ],
      ま行:     ['ま',   'み',   'む',   'め',   'も'  ],
      や行:     ['や',   'い',   'ゆ',   'え',   'よ'  ],
      ら行:     ['ら',   'り',   'る',   'れ',   'ろ'  ],
      わ行:     ['わ',   'ゐ',   'う',   'ゑ',   'を'  ],

      # 表1b 直音をあらわすカナ(濁点・半濁点がつくもの)
      が行:     ['が',   'ぎ',   'ぐ',   'げ',   'ご'  ],
      ざ行:     ['ざ',   'じ',   'ず',   'ぜ',   'ぞ'  ],
      だ行:     ['だ',   'ぢ',   'づ',   'で',   'ど'  ],
      ば行:     ['ば',   'び',   'ぶ',   'べ',   'ぼ'  ],
      ぱ行:     ['ぱ',   'ぴ',   'ぷ',   'ぺ',   'ぽ'  ],
      ゃ行:     ['ゃ',   'ぃ',   'ゅ',   'ぅ',   'ょ'  ],

      # イ列ヤ行拗音をあらわすカナ
      きゃ行:   ['きゃ', 'きぃ', 'きゅ', 'きぇ', 'きょ'],
      しゃ行:   ['しゃ', 'しぃ', 'しゅ', 'しぇ', 'しょ'],
      ちゃ行:   ['ちゃ', 'ちぃ', 'ちゅ', 'ちぇ', 'ちょ'],
      にゃ行:   ['にゃ', 'にぃ', 'にゅ', 'にぇ', 'にょ'],
      ひゃ行:   ['ひゃ', 'ひぃ', 'ひゅ', 'ひぇ', 'ひょ'],
      みゃ行:   ['みゃ', 'みぃ', 'みゅ', 'みぇ', 'みょ'],
      りゃ行:   ['りゃ', 'りぃ', 'りゅ', 'れぇ', 'りょ'],

      # 表2b イ列ヤ行拗音をあらわすカナ(濁点・半濁点がつくもの)
      ぎゃ行:   ['ぎゃ', 'ぎぃ', 'ぎゅ', 'ぎぇ', 'ぎょ'],
      じゃ行:   ['じゃ', 'じぃ', 'じゅ', 'じぇ', 'じょ'],
      ぢゃ行:   ['ぢゃ', 'ぢぃ', 'ぢゅ', 'ぢぇ', 'ぢょ'],
      びゃ行:   ['びゃ', 'びぃ', 'びゅ', 'びぇ', 'びょ'],
      ぴゃ行:   ['ぴゃ', 'ぴぃ', 'ぴゅ', 'ぴぇ', 'ぴょ'],

      # 表3a ウ列ワ行拗音をあらわすカナ
      うぁ行:   ['うぁ', 'うぃ', 'う',   'うぇ', 'うぉ'], # 99 w
      くぁ行:   ['くぁ', 'くぃ', 'く',   'くぇ', 'くぉ'], # 99 kw
      すぁ行:   ['すぁ', 'すぃ', 'すぅ', 'すぇ', 'すぉ'], # 99 sw
      # つぁ -> 表3c
      ぬぁ行:   ['ぬぁ', 'ぬぃ', 'ぬぅ', 'ぬぇ', 'ぬぉ'], # 99 nw
      # ふぁ -> 表3c
      むぁ行:   ['むぁ', 'むぃ', 'むぅ', 'むぇ', 'むぉ'], # 99 mw
      るぁ行:   ['るぁ', 'るぃ', 'るぅ', 'るぇ', 'るぉ'], # 99 rw

      # 表3b ウ列ワ行拗音をあらわすカナ(濁点・半濁点がつくもの)
      ぐぁ行:   ['ぐぁ', 'ぐぃ', 'ぐ',   'ぐぇ', 'ぐぉ'], # Mozcにない行
      ずぁ行:   ['ずぁ', 'ずぃ', 'ずぅ', 'ぐぇ', 'ぐぉ'], # 99 zw # Mozcにない行
      ぶぁ行:   ['ぶぁ', 'ぶぃ', 'ぶぅ', 'ぶぇ', 'ぶぉ'],

      # 表3c ウ列ワ行拗音をあらわすカナの例外、およびオ列ワ行拗音をあらわすカナ
      つぁ行:   ['つぁ', 'つぃ', 'つぅ', 'つぇ', 'つぉ'], # 99 ts # Mozcに「つぅ」ない
      づぁ行:   ['づぁ', 'づぃ', 'づぅ', 'づぇ', 'づぉ'], # 99 zw[dz] # Mozcにない行
      とぁ行:   ['とぁ', 'とぃ', 'とぅ', 'とぇ', 'とぉ'], # 99 tw
      どぁ行:   ['どぁ', 'どぃ', 'どぅ', 'どぇ', 'どぉ'], # 99 dw
      ふぁ行:   ['ふぁ', 'ふぃ', 'ふぅ', 'ふぇ', 'ふぉ'], # 99 f
      ほぁ行:   ['ほぁ', 'ほぃ', 'ほぅ', 'ほぇ', 'ほぉ'], # 99 hw
      ゔぁ行:   ['ゔぁ', 'ゔぃ', 'ゔ',   'ゔぇ', 'ゔぉ'], # 99 v（u例外）

      # 表4 エ列ヤ行拗音をあらわすカナ
      ふゃ行:   ['ふゃ', 'ふぃ', 'ふゅ', 'ふぇ', 'ふょ'],
      てゃ行:   ['てゃ', 'てぃ', 'てゅ', 'てぇ', 'てょ'], # 99 tj
      でゃ行:   ['でゃ', 'でぃ', 'でゅ', 'でぇ', 'でょ'], # 99 dj

      # 表5 ウ列ヤ行拗音をあらわすカナ
      ふゃ行:   ['ふゃ', 'ふぃ', 'ふゅ', 'ふぇ', 'ふょ'], # 99 fy（i,e空白）# Mozcにない
      ゔゃ行:   ['ゔゃ', 'ゔぃ', 'ゔゅ', 'ゔぇ', 'ゔょ'], # 99 vy（i,e空白）# Mozcにない

      # 99式にはない行
      ぁ行:     ['ぁ',   'ぃ',   'ぅ',   'ぇ',   'ぉ'  ], # la, xa
      しゃ行H:  ['しゃ', 'しぃ', 'し',   'しぇ', 'しょ'], # ヘボン式のshiは「し」
      ちゃ行H:  ['ちゃ', 'ち',   'ちゅ', 'ちぇ', 'ちょ'], # ヘボン式のchiは「ち」
      じゃ行H:  ['じゃ', 'じ',   'じゅ', 'じぇ', 'じょ'], # ヘボン式のji は「じ」
    }
  end
end
