# -*- coding: utf-8 -*-

require './generator'

Generator.execute <<-EOS
  #{DATA.read}
EOS
__END__

################################################################
# DSL
#

子音 = {
  か行: {左右: :右, 段: :上, 番号: 2}, # c
  さ行: {左右: :右, 段: :中, 番号: 4}, # s
  た行: {左右: :右, 段: :中, 番号: 2}, # t
  な行: {左右: :右, 段: :中, 番号: 3}, # n
  は行: {左右: :右, 段: :中, 番号: 1}, # h
  ま行: {左右: :右, 段: :下, 番号: 1}, # m
  や行: {左右: :右, 段: :下, 番号: 3}, # v
  ら行: {左右: :右, 段: :上, 番号: 3}, # r
  わ行: {左右: :右, 段: :下, 番号: 2}, # w
  が行: {左右: :右, 段: :上, 番号: 1}, # g
  ざ行: {左右: :右, 段: :下, 番号: 4}, # z
  だ行: {左右: :右, 段: :中, 番号: 0}, # d
  ば行: {左右: :右, 段: :下, 番号: 0}, # b
  ぱ行: {左右: :右, 段: :上, 番号: 0}, # f
  ぁ行: {左右: :右, 段: :上, 番号: 4}, # l
}

左中 = {左右: :左, 段: :中}
左下 = {左右: :左, 段: :下}

################################################################
# ローマ字変換表（JLOD）
#

# どの変化キーを使うか？
# 母音の段は？

=begin
# あ行
変換 :あ行,母音: 左中

# か〜ぱ行, ぁ行
[:か行, :さ行,:た行, :な行, :は行, :ま行, :や行, :ら行, :わ行,
 :が行, :ざ行,:だ行, :ば行, :ば行, :ぱ行, :ぁ行].each do |行|
  変換 行, 子音: 子音[行], 母音: 左中
end
=end

=begin
# NOTE促音+母音下があいてる
拗音L = {左右: :右, 番号: 1}
拗音R = {左右: :右, 番号: 3}

# NOTE: vma追加
[[:きゃ行, :か行], [:ぎゃ行, :が行], [:しゃ行, :さ行], [:じゃ行, :ざ行],
 [:ちゃ行, :た行], [:ぢゃ行, :だ行], [:てゃ行, nil],   [:でゃ行, nil],
 [:にゃ行, :な行], [:ひゃ行, :は行], [:ぴゃ行, :ぱ行], [:ふゃ行, nil],
 [:りゃ行, :ら行], [:ゔゃ行, nil],   [:ぴゃ行, :ぱ行], [:ふゃ行, nil],
 [:ゃ行,   :や行],
].each do |行, 鍵|
  if 鍵
    拗音鍵 = 子音[鍵][:番号] < 2 ? 拗音R : 拗音L
    変換 行,  子音: 子音[鍵], 拗音化: 拗音鍵, 母音: :鍵盤
  end
end
=end

# 促音を母音上に割り当てるてもある
促音L = {左右: :右, 番号: 0}
促音R = {左右: :右, 番号: 2} # NOTE: 追加

# か〜ぱ行, ぁ行
[:か行, :さ行,:た行, :な行, :は行, :ま行, :や行, :ら行, :わ行,
 :が行, :ざ行,:だ行, :ば行, :ば行, :ぱ行, :ぁ行].each do |行|
  促音鍵 = 子音[行][:番号] < 2 ? 促音R : 促音L
  変換 行, 子音: 子音[行], 促音化: 促音鍵, 母音: 左中
end

# あ行
変換 :あ行, 撥音化: {}, 母音: 左下

# BUG: 促音化の定義がおかしい？
# 変換 :あ行, 促音化: {}, 母音: 左下 -> Error

#
=begin
二重母音登録 ['あい', 'うい', 'うう', 'えい', 'おう']
変換 二重母音(きゃ行), 子音: {左右: :右, 段: :中, 番号: 2}, 拗音化: {左右: :右, 段: :上, 番号: 0}, 母音: :鍵盤
=end

=begin
# # ん・記号
# t += g.変換('っ', 位置: [{左右: :左, 段: :上, 番号: 0}])
# t += g.変換('，', 位置: [{左右: :左, 段: :上, 番号: 1}])
# t += g.変換('．', 位置: [{左右: :左, 段: :上, 番号: 2}])
# t += g.変換('ー', 位置: [{左右: :左, 段: :上, 番号: 3}])
# t += g.変換('？', 位置: [{左右: :左, 段: :上, 番号: 4}])
# t += g.変換('ん', 位置: [{左右: :右, 段: :中, 番号: 3}, {左右: :右, 段: :中, 番号: 3}])


# 撥音（＋ん）
# t += g.変換("あいうえお", 母音位置: {左右: :左, 段: :下}, 撥音化: {}) # 撥音化鍵は省略
# t += g.変換("かきくけこ", 子音位置: 子音[:か行], 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('さしすせそ', 子音位置: 子音[:さ行], 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('たちつてと', 子音位置: {左右: :右, 段: :中, 番号: 2}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('なにぬねの', 子音位置: {左右: :右, 段: :中, 番号: 3}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('はひふへほ', 子音位置: {左右: :右, 段: :中, 番号: 1}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('まみむめも', 子音位置: {左右: :右, 段: :下, 番号: 1}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('や　ゆ　よ', 子音位置: {左右: :右, 段: :下, 番号: 3}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('らりるれろ', 子音位置: {左右: :右, 段: :上, 番号: 3}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('わゐ　ゑを', 子音位置: {左右: :右, 段: :下, 番号: 2}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('がぎぐげご', 子音位置: {左右: :右, 段: :上, 番号: 1}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('ざじずぜぞ', 子音位置: {左右: :右, 段: :下, 番号: 4}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('だぢづでど', 子音位置: {左右: :右, 段: :中, 番号: 0}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('ばびぶべぼ', 子音位置: {左右: :右, 段: :下, 番号: 0}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('ぱぴぷぺぽ', 子音位置: {左右: :右, 段: :上, 番号: 0}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})
# t += g.変換('き', 子音位置: {左右: :右, 段: :上, 番号: 2},
#             拗音化: {左右: :右, 番号: 1}, 撥音化: {}, 母音位置: {左右: :左, 段: :下})

# # 二重母音
# t += g.変換(['あい', 'うい', 'うう', 'えい', 'おう'], 母音位置: {左右: :左, 段: :上})
# t += g.変換(['かい', 'くい', 'くう', 'けい', 'こう'], 子音位置: {左右: :右, 段: :上, 番号: 2}, 母音位置: {左右: :左, 段: :上})
# t += g.変換(['さい', 'すい', 'すう', 'せい', 'そう'], 子音位置: {左右: :右, 段: :中, 番号: 4}, 母音位置: {左右: :左, 段: :上})
# # 省略

################################################################
#
# 拗音
#

# 拗音鍵 = {左右: :右, 段: :中, 番号: 1}
拗音鍵 = {左右: :右, 番号: 1}

t += g.変換(:きゃ行, 子音位置: 子音[:か行], 拗音化: 拗音鍵, 母音位置: {左右: :左, 段: :中})
t += g.変換(:しゃ行, 子音位置: 子音[:さ行], 拗音化: 拗音鍵, 母音位置: {左右: :左, 段: :中})

t.each do |i|
  puts "#{i[0]}\t#{i[1]}"
end
=end
