# -*- coding: utf-8 -*-

require 'generator'

describe Generator, '#変換表作成' do
  subject(:it) {Generator.new}
  
  it '生成されたか？' do
    expect(it).not_to be nil
  end

  it '変換表が追加されたか？' do
    expect(it.変換表作成 'a', 'あ').to eq ["a", "あ"]
  end
end

describe Generator, '#省略R' do
  subject(:it) {Generator.new}
  
  it '鍵の位置を省略して指定します' do
    expect(it.省略R(位置: {左右: :左, 段: :中, 番号: 0})).to eq 'a'
    expect(it.省略R(位置: {左右: :左, 番号: 0}, 段: :中)).to eq 'a'
    expect{it.省略R(位置: {左右: :左, 番号: 0})}.to raise_error
    expect(it.省略R(位置: {})).to eq ''
  end
end

describe Generator, '#変換' do
  it '直接位置指定登録を検査します' do 
    g = Generator.new
    g.変換('っ', 位置: [{左右: :左, 段: :上, 番号: 0}]).should eq([["'", "っ"]])
    g.変換('，', 位置: [{左右: :左, 段: :上, 番号: 1}]).should eq([[",", "，"]])
    g.変換('．', 位置: [{左右: :左, 段: :上, 番号: 2}]).should eq([[".", "．"]])
    g.変換('ー', 位置: [{左右: :左, 段: :上, 番号: 3}]).should eq([["p", "ー"]])
    g.変換('？', 位置: [{左右: :左, 段: :上, 番号: 4}]).should eq([["y", "？"]])
    g.変換('ん', 位置: [{左右: :右, 段: :中, 番号: 3},
                        {左右: :右, 段: :中, 番号: 3}]).should eq([["nn", "ん"]])
  end

  it '母音を検査します（あいうえお）' do
    g = Generator.new
    g.変換('あいうえお', 母音位置: {左右: :左, 段: :中}).
      should eq([["a", "あ"], ["i", "い"], ["u", "う"], ["e", "え"], ["o", "お"]])
    expect{g.変換('いうえお', 母音位置: {左右: :左, 段: :中})}.to raise_error
  end
  
  it '母音+撥音を検査します（あん・いん・うん・えん・おん）' do
    g = Generator.new
    g.変換("あいうえお", 撥音化: {}, 母音位置: {左右: :左, 段: :下}).
      should eq([[";", "あん"], ["x", "いん"], ["k", "うん"],
                 ["j", "えん"], ["q", "おん"]])
  end
  
  it '静音を検査します' do
    g = Generator.new
    g.変換('かきくけこ', 子音位置: {左右: :右, 段: :上, 番号: 2},
           母音位置: {左右: :左, 段: :中}).
      should eq([["ca", "か"], ["ci", "き"], ["cu", "く"], ["ce", "け"], ["co", "こ"]])
    g.変換('さしすせそ', 子音位置: {左右: :右, 段: :中, 番号: 4},
           母音位置: {左右: :左, 段: :中}).
      should eq([["sa", "さ"], ["si", "し"], ["su", "す"], ["se", "せ"], ["so", "そ"]])
    g.変換('たちつてと', 子音位置: {左右: :右, 段: :中, 番号: 2},
           母音位置: {左右: :左, 段: :中}).
      should eq([["ta", "た"], ["ti", "ち"], ["tu", "つ"], ["te", "て"], ["to", "と"]])
    g.変換('なにぬねの', 子音位置: {左右: :右, 段: :中, 番号: 3},
           母音位置: {左右: :左, 段: :中}).
      should eq([["na", "な"], ["ni", "に"], ["nu", "ぬ"], ["ne", "ね"], ["no", "の"]])
    g.変換('はひふへほ', 子音位置: {左右: :右, 段: :中, 番号: 1},
           母音位置: {左右: :左, 段: :中}).
      should eq([["ha", "は"], ["hi", "ひ"], ["hu", "ふ"], ["he", "へ"], ["ho", "ほ"]])
    g.変換('まみむめも', 子音位置: {左右: :右, 段: :下, 番号: 1},
           母音位置: {左右: :左, 段: :中}).
      should eq([["ma", "ま"], ["mi", "み"], ["mu", "む"], ["me", "め"], ["mo", "も"]])
    g.変換('や？ゆ？よ', 子音位置: {左右: :右, 段: :下, 番号: 3},
           母音位置: {左右: :左, 段: :中}).
      should eq([["va", "や"], ["vi", "？"], ["vu", "ゆ"], ["ve", "？"], ["vo", "よ"]])
    g.変換('らりるれろ', 子音位置: {左右: :右, 段: :上, 番号: 3},
           母音位置: {左右: :左, 段: :中}).
      should eq([["ra", "ら"], ["ri", "り"], ["ru", "る"], ["re", "れ"], ["ro", "ろ"]])
    g.変換('わゐ？ゑを', 子音位置: {左右: :右, 段: :下, 番号: 2},
           母音位置: {左右: :左, 段: :中}).
      should eq([["wa", "わ"], ["wi", "ゐ"], ["wu", "？"], ["we", "ゑ"], ["wo", "を"]])
  end
  
  it '濁音・半濁音を検査します' do
    g = Generator.new
    g.変換('がぎぐげご', 子音位置: {左右: :右, 段: :上, 番号: 1},
           母音位置: {左右: :左, 段: :中}).
      should eq([["ga", "が"], ["gi", "ぎ"], ["gu", "ぐ"], ["ge", "げ"], ["go", "ご"]])
    g.変換('ざじずぜぞ', 子音位置: {左右: :右, 段: :下, 番号: 4},
           母音位置: {左右: :左, 段: :中}).
      should eq([["za", "ざ"], ["zi", "じ"], ["zu", "ず"], ["ze", "ぜ"], ["zo", "ぞ"]])
    g.変換('だぢづでど', 子音位置: {左右: :右, 段: :中, 番号: 0},
           母音位置: {左右: :左, 段: :中}).
      should eq([["da", "だ"], ["di", "ぢ"], ["du", "づ"], ["de", "で"], ["do", "ど"]])
    g.変換('ばびぶべぼ', 子音位置: {左右: :右, 段: :下, 番号: 0},
           母音位置: {左右: :左, 段: :中}).
      should eq([["ba", "ば"], ["bi", "び"], ["bu", "ぶ"], ["be", "べ"], ["bo", "ぼ"]])
    g.変換('ぱぴぷぺぽ', 子音位置: {左右: :右, 段: :上, 番号: 0},
           母音位置: {左右: :左, 段: :中}).
      should eq([["fa", "ぱ"], ["fi", "ぴ"], ["fu", "ぷ"], ["fe", "ぺ"], ["fo", "ぽ"]])
  end
  
  it '子音+母音+撥音（一括）を検査します' do
    g = Generator.new
    g.変換("かきくけこ",
           子音位置: {左右: :右, 段: :上, 番号: 2},
           撥音化: {},
           母音位置: {左右: :左, 段: :下}). # 番号は省略
      should eq([["c;", "かん"], ["cx", "きん"], ["ck", "くん"], ["cj", "けん"], ["cq", "こん"]])
  end

  it '子音＋拗音化＋母音を検査します' do
    g = Generator.new
    g.変換('き',
           子音位置: {左右: :右, 段: :上, 番号: 2},
           拗音化: {左右: :右, 番号: 1},
           母音位置: {左右: :左, 段: :中}).
       should eq([["cga", "きゃ"], ["cgi", "きぃ"], ["cgu", "きゅ"], ["cge", "きぇ"], ["cgo", "きょ"]])
  end

  it '子音＋拗音化＋撥音化＋母音を検査します' do
    g = Generator.new
    g.変換('き',
           子音位置: {左右: :右, 段: :上, 番号: 2},
           拗音化: {左右: :右, 番号: 1},
           撥音化: {}, # 撥音化鍵は省略
           母音位置: {左右: :左, 段: :下}).
       should eq([["cg;", "きゃん"], ["cgx", "きぃん"], ["cgk", "きゅん"], ["cgj", "きぇん"], ["cgq", "きょん"]])
  end
  
  it '子音＋拗音＋母音＋促音を検査します' do
    g = Generator.new
    g.変換('き',
           子音位置: {左右: :右, 段: :上, 番号: 2},
           拗音化: {}, # 拗音化鍵は省略
           促音化: {左右: :右, 番号: 0},
           母音位置: {左右: :左, 段: :上}
           ).
       should eq([["cf'", "きゃっ"], ["cfy", "きぃっ"], ["cfp", "きゅっ"], ["cf.", "きぇっ"], ["cf,", "きょっ"]])
    g.変換('き',
           子音位置: {左右: :右, 段: :上, 番号: 2},
           拗音化: {},
           促音化: {左右: :右, 段: :中, 番号: 0}, # 文字固定の場合
           母音位置: {左右: :左, 段: :上}
           ).
       should eq([["cd'", "きゃっ"], ["cdy", "きぃっ"], ["cdp", "きゅっ"], ["cd.", "きぇっ"], ["cd,", "きょっ"]])
  end

  it '二重母音（あい，おう，えい，うう，うい）を検査します' do
    g = Generator.new
    g.変換(['あい', 'うい', 'うう', 'えい', 'おう'],
           母音位置: {左右: :左, 段: :上}
           ).
      should eq([["'", "あい"], ["y", "うい"], ["p", "うう"], [".", "えい"], [",", "おう"]])
  end
  
  # かい，くい（キー），くう（クー），けい（ケー），こう（コー）
  it '二重母音（かい，こう，けい，くう，くい）を検査します' do
    g = Generator.new
    g.変換(['かい', 'くい', 'くう', 'けい', 'こう'],
           子音位置: {左右: :右, 段: :上, 番号: 2},
           母音位置: {左右: :左, 段: :上}
           ).
      should eq([["c'", "かい"], ["cy", "くい"], ["cp", "くう"], ["c.", "けい"], ["c,", "こう"]])
  end
  
  # pending 'QWERTY配列の場合，母音の位置を一つづつ追加する方法'
  # #   母音鍵 ['a', {左右: 左, 段: 上, 番号: 0}]
  # #   母音鍵 ['i', {左右: 右, 段: 上, 番号: 2}]
  # #   母音鍵 ['an', {左右: 右, 段: 下, 番号: 4}]
  
  # pending '二重母音の位置を省略して登録する方法'
  # # b) 番号を省略
  # #   母音鍵 [['an', 'ui', 'uu', 'ei', 'ou'', {左右: 左, 段: :下}]

  # pending '子音は母音の数だけ反復して自動生成'

  ################################################################
end


describe Generator, '#行' do
  subject(:it){Generator.new}

  it '行操作を検査します' do
    expect(it.行 :あ行).to eq 'あいうえお'
    expect(it.行 :か行).to eq 'かきくけこ'
    expect(it.行 :さ行).to eq 'さしすせそ'
    expect(it.行 :た行).to eq 'たちつてと'
    expect(it.行 :な行).to eq 'なにぬねの'
    expect(it.行 :は行).to eq 'はひふへほ'
    expect(it.行 :ま行).to eq 'まみむめも'
    expect(it.行 :や行).to eq 'や　ゆ　よ'
    expect(it.行 :ら行).to eq 'らりるれろ'
    expect(it.行 :わ行).to eq 'わゐ　ゑを'
  end
end

describe Generator, '#母音位置' do
  subject(:it){Generator.new}

  it '番号を指定して母音位置を検査します' do
    expect(it.母音位置(:左, :中, 番号: 0).length).to eq 1
    expect(it.母音位置(:左, :中, 番号: 0)).to eq [{左右: :左, 段: :中, 番号: 0}]
    expect{it.位置展開(:左, :中, 番号: -1)}.to raise_error
  end
  
  it '母音位置を検査します' do
    expect(it.母音位置(:左, :中).length).to eq 5
    expect(it.母音位置(:左, :中)).
      to eq [{左右: :左, 段: :中, 番号: 0},
             {左右: :左, 段: :中, 番号: 4},
             {左右: :左, 段: :中, 番号: 3},
             {左右: :左, 段: :中, 番号: 2},
             {左右: :左, 段: :中, 番号: 1}]
  end
  
  it '母音順を設定して母音位置を検査します' do
    it.母音順 = [4, 3, 2, 1, 0]
    expect(it.母音位置(:左, :中)).
      to eq [{左右: :左, 段: :中, 番号: 4},
             {左右: :左, 段: :中, 番号: 3},
             {左右: :左, 段: :中, 番号: 2},
             {左右: :左, 段: :中, 番号: 1},
             {左右: :左, 段: :中, 番号: 0}]
    it.母音順 = nil
    expect{it.母音位置(左右: :左, 段: :中)}.to raise_error
  end
end

describe Generator, '#鍵盤母音位置' do
  subject(:it){Generator.new}
  
  it '鍵盤母音位置を検査します' do
    expect(it.鍵盤母音位置.length).to eq 5
    expect(it.鍵盤母音位置).
      to eq [{左右: :左, 段: :中, 番号: 0},
             {左右: :左, 段: :中, 番号: 4},
             {左右: :左, 段: :中, 番号: 3},
             {左右: :左, 段: :中, 番号: 2},
             {左右: :左, 段: :中, 番号: 1}]
  end
  
  it '鍵盤を設定して鍵盤母音位置を検査します' do
    it.鍵盤 = {
      左: { 上: 'qwert', 中: 'asdfg', 下: 'zxcvb'},
      右: { 上: 'yuiop', 中: 'hjkl;', 下: 'bnm,.'}
    }
    expect(it.鍵盤母音位置.length).to eq 5
    expect(it.鍵盤母音位置).
      to eq [{左右: :左, 段: :中, 番号: 0},
             {左右: :右, 段: :上, 番号: 2},
             {左右: :右, 段: :上, 番号: 1},
             {左右: :左, 段: :上, 番号: 2},
             {左右: :右, 段: :上, 番号: 3}]
  end
end

# Coverage
# file:///home/yc/git/romantable_generator/coverage/index.html
